app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Carros"], ["created_at", "2016-03-10 22:09:11.229240"], ["updated_at", "2016-03-10 22:09:11.229240"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save