app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "toyota"], ["price", 123123.0], ["created_at", "2016-03-10 22:12:53.733852"], ["updated_at", "2016-03-10 22:12:53.733852"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @product = Product.find(params[:id])