app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label "Categoria" %><br />
    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |b| %>