app/views/products/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = ?  [["product_id", 1]]
---
        <td><%= product.name %></td>
        <td><%= product.categories.map(&:name).sort.join(", ") %></td>